kosszv/alcoholometer-esp32/clouds/reMqtt/src/reMqtt.cpp
#include "reMqtt.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/task.h"
#include "mbedtls/ssl.h"
#include <time.h>
#include "reTgSend.h"

static const char* logTAG = "MQTT";

#define MQTT_LOG_PAYLOAD_LIMIT 2048

#if defined(CONFIG_MQTT1_TYPE) && CONFIG_MQTT1_TLS_ENABLED && !defined(CONFIG_MQTT1_TLS_STORAGE)
  #define CONFIG_MQTT1_TLS_STORAGE TLS_CERT_BUFFER
#endif // CONFIG_MQTT1_TLS_STORAGE

#if defined(CONFIG_MQTT2_TYPE) && CONFIG_MQTT2_TLS_ENABLED && !defined(CONFIG_MQTT2_TLS_STORAGE)
  #define CONFIG_MQTT2_TLS_STORAGE TLS_CERT_BUFFER
#endif // CONFIG_MQTT2_TLS_STORAGE

#if defined(CONFIG_MQTT1_TYPE) && CONFIG_MQTT1_TLS_ENABLED && (CONFIG_MQTT1_TLS_STORAGE == TLS_CERT_BUFFER)
  extern const uint8_t mqtt1_broker_pem_start[] asm(CONFIG_MQTT1_TLS_PEM_START);
  extern const uint8_t mqtt1_broker_pem_end[]   asm(CONFIG_MQTT1_TLS_PEM_END); 
#endif // CONFIG_MQTT1_TLS_ENABLED
#if defined(CONFIG_MQTT2_TYPE) && CONFIG_MQTT2_TLS_ENABLED && (CONFIG_MQTT2_TLS_STORAGE == TLS_CERT_BUFFER)
  extern const uint8_t mqtt2_broker_pem_start[] asm(CONFIG_MQTT2_TLS_PEM_START);
  extern const uint8_t mqtt2_broker_pem_end[]   asm(CONFIG_MQTT2_TLS_PEM_END); 
#endif // CONFIG_MQTT2_TLS_ENABLED

static esp_mqtt_client_handle_t _mqttClient = nullptr;
static re_mqtt_event_data_t _mqttData;
static uint32_t _mqttConnAttempt = 0;

// Forward declarations
esp_err_t mqttClientCreate();
esp_err_t mqttClientRestart();
esp_err_t mqttClientStop();
esp_err_t mqttClientDestroy();

// -----------------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------- Status bits -----------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

static const uint32_t MQTTCLI_STARTED            = BIT0;
static const uint32_t MQTTCLI_INET_AVAILABLED    = BIT1;
static const uint32_t MQTTCLI_SERVER1_AVAILABLED = BIT2;
static const uint32_t MQTTCLI_SERVER2_AVAILABLED = BIT3;
static const uint32_t MQTTCLI_SERVER2_ACTIVE     = BIT4;
static const uint32_t MQTTCLI_CONNECTED          = BIT5;
static const uint32_t MQTTCLI_ERROR              = BIT6;

static EventGroupHandle_t _mqttStates = nullptr;
#if CONFIG_MQTT_STATIC_ALLOCATION
  StaticEventGroup_t _mqttBufStates;
#endif // CONFIG_MQTT_STATIC_ALLOCATION

bool mqttStatesInit() 
{
  if (_mqttStates == nullptr) {
    #if CONFIG_MQTT_STATIC_ALLOCATION
      _mqttStates = xEventGroupCreateStatic(&_mqttBufStates);
    #else
      _mqttStates = xEventGroupCreate();
    #endif // CONFIG_MQTT_STATIC_ALLOCATION
    if (_mqttStates != nullptr) {
      xEventGroupClearBits(_mqttStates, 0x00FFFFFFU);
      xEventGroupSetBits(_mqttStates, MQTTCLI_INET_AVAILABLED | MQTTCLI_SERVER1_AVAILABLED | MQTTCLI_SERVER2_AVAILABLED);
    } else {
      rlog_e(logTAG, "Failed to create event group!");
    };
  };
  return _mqttStates != nullptr;
}

void mqttStatesFree() 
{
  if (_mqttStates) {
    vEventGroupDelete(_mqttStates);
    _mqttStates = nullptr;
  };
}

EventBits_t mqttStatesGet() 
{
  if (_mqttStates) {
    return xEventGroupGetBits(_mqttStates);
  };
  rlog_e(logTAG, "Failed to get status bits, event group is null!");
  return 0;
}

bool mqttStatesCheck(EventBits_t bits, const bool clearOnExit) 
{
  if (_mqttStates) {
    if (clearOnExit) {
      return (xEventGroupClearBits(_mqttStates, bits) & bits) == bits;
    } else {
      return (xEventGroupGetBits(_mqttStates) & bits) == bits;
    };
  };
  rlog_e(logTAG, "Failed to check status bits: %X, event group is null!", bits);
  return false;
}

bool mqttStatesClear(EventBits_t bits)
{
  if (!_mqttStates) {
    rlog_e(logTAG, "Failed to set status bits: %X, event group is null!", bits);
    return false;
  };
  EventBits_t prevClear = xEventGroupClearBits(_mqttStates, bits);
  if ((prevClear & bits) != 0) {
    EventBits_t afterClear = xEventGroupGetBits(_mqttStates);
    if ((afterClear & bits) != 0) {
      rlog_e(logTAG, "Failed to clear status bits: %X, current value: %X", bits, afterClear);
      return false;
    };
  };
  return true;
}

bool mqttStatesSet(EventBits_t bits)
{
  if (!_mqttStates) {
    rlog_e(logTAG, "Failed to set status bits: %X, event group is null!", bits);
    return false;
  };
  EventBits_t afterSet = xEventGroupSetBits(_mqttStates, bits);
  if ((afterSet & bits) != bits) {
    rlog_e(logTAG, "Failed to set status bits: %X, current value: %X", bits, afterSet);
    return false;
  };
  return true;
}

bool mqttStatesSetBit(EventBits_t bit, bool state)
{
  if (state) {
    return mqttStatesSet(bit);
  } else {
    return mqttStatesClear(bit);
  };
}

EventBits_t mqttStatesWait(EventBits_t bits, BaseType_t clearOnExit, BaseType_t waitAllBits, TickType_t timeout)
{
  if (_mqttStates) {
    return xEventGroupWaitBits(_mqttStates, bits, clearOnExit, waitAllBits, timeout) & bits; 
  };  
  return 0;
}

EventBits_t mqttStatesWaitMs(EventBits_t bits, BaseType_t clearOnExit, BaseType_t waitAllBits, TickType_t timeout)
{
  if (_mqttStates) {
    if (timeout == 0) {
      return xEventGroupWaitBits(_mqttStates, bits, clearOnExit, waitAllBits, portMAX_DELAY) & bits; 
    }
    else {
      return xEventGroupWaitBits(_mqttStates, bits, clearOnExit, waitAllBits, pdMS_TO_TICKS(timeout)) & bits; 
    };
  };  
  return 0;
}

// -----------------------------------------------------------------------------------------------------------------------
// --------------------------------------------- Return to main server timer ---------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

#if defined(CONFIG_MQTT2_TYPE) && defined(CONFIG_MQTT_BACK_TO_PRIMARY_TIME_MINUTES) && (CONFIG_MQTT_BACK_TO_PRIMARY_TIME_MINUTES > 0)

