kosszv/alcoholometer-esp32/clouds/reMqtt/src/reMqtt.cpp
#include "esp_timer.h"

esp_timer_handle_t _mqttBackToPrimaryTimer = nullptr;

bool mqttServer1SetAvailable(bool newAvailable);
void mqttBackToPrimaryTimerEnd(void* arg)
{
  mqttServer1SetAvailable(true); 
}

bool mqttBackToPrimaryTimerInit()
{
  if (_mqttBackToPrimaryTimer == nullptr) {
    esp_timer_create_args_t cfg;
    memset(&cfg, 0, sizeof(cfg));
    cfg.name = "mqtt_b2p";
    cfg.skip_unhandled_events = false;
    cfg.callback = mqttBackToPrimaryTimerEnd;
    RE_OK_CHECK(esp_timer_create(&cfg, &_mqttBackToPrimaryTimer), return false);
    rlog_i(logTAG, "The return timer to the main MQTT server is created");
  };
  return true;
}

bool mqttBackToPrimaryTimerStop()
{
  if ((_mqttBackToPrimaryTimer != nullptr) && esp_timer_is_active(_mqttBackToPrimaryTimer)) {
    RE_OK_CHECK(esp_timer_stop(_mqttBackToPrimaryTimer), return false);
    rlog_i(logTAG, "The return timer to the main MQTT server was stopped");
  };  
  return true;
}

bool mqttBackToPrimaryTimerFree()
{
  if (_mqttBackToPrimaryTimer != nullptr) {
    mqttBackToPrimaryTimerStop();
    RE_OK_CHECK(esp_timer_delete(_mqttBackToPrimaryTimer), return false);
    rlog_i(logTAG, "The return timer to the main MQTT server is deleted");
  };
  return true;
}

bool mqttBackToPrimaryTimerStart()
{
  if (_mqttBackToPrimaryTimer == nullptr) {
    if (!mqttBackToPrimaryTimerInit()) {
      return false;
    };
  };
  mqttBackToPrimaryTimerStop();
  RE_OK_CHECK(esp_timer_start_once(_mqttBackToPrimaryTimer, 60000000UL*CONFIG_MQTT_BACK_TO_PRIMARY_TIME_MINUTES), return false);
  rlog_i(logTAG, "The return timer to the main MQTT server was started");
  return true;
}

#else

bool mqttBackToPrimaryTimerInit()
{
  return true;
}

bool mqttBackToPrimaryTimerFree()
{
  return true;
}

bool mqttBackToPrimaryTimerStart()
{
  return true;
}

bool mqttBackToPrimaryTimerStop()
{
  return true;
}

#endif // CONFIG_MQTT_BACK_TO_PRIMARY_TIME_MINUTES

// -----------------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------- Routines --------------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

bool mqttIsConnected() 
{
  return wifiIsConnected() && (_mqttClient) && mqttStatesCheck(MQTTCLI_STARTED | MQTTCLI_CONNECTED, false);
}

bool mqttIsPrimary()
{
  return !mqttStatesCheck(MQTTCLI_SERVER2_ACTIVE, false);
}

int mqttGetOutboxSize()
{
  return esp_mqtt_client_get_outbox_size(_mqttClient);
}

void mqttErrorEventSend(const char* message, const char* object)
{
  mqttStatesSet(MQTTCLI_ERROR);
  if (message) {
    if (object) {
      char* err_msg = malloc_stringf(message, object);
      if (err_msg) {
        eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_ERROR, (void*)err_msg, strlen(err_msg)+1, portMAX_DELAY);
        free(err_msg);
      };
    } else {
      eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_ERROR, (void*)message, strlen(message)+1, portMAX_DELAY);
    };
  } else {
    eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_ERROR, nullptr, 0, portMAX_DELAY);
  };
}

void mqttErrorEventSendCode(const char* message, const char* object, esp_err_t error_code)
{
  mqttStatesSet(MQTTCLI_ERROR);
  if (message) {
    char* err_msg = nullptr;
    if (object) {
      err_msg = malloc_stringf(message, object, error_code, esp_err_to_name(error_code));
    } else {
      err_msg = malloc_stringf(message, error_code, esp_err_to_name(error_code));
    };
    if (err_msg) {
      eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_ERROR, (void*)err_msg, strlen(err_msg)+1, portMAX_DELAY);
      free(err_msg);
    };
  };
}

void mqttErrorEventClear()
{
  if (mqttStatesCheck(MQTTCLI_ERROR, true)) {
    eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_ERROR_CLEAR, nullptr, 0, portMAX_DELAY);
  };
}

// -----------------------------------------------------------------------------------------------------------------------
// ------------------------------------------------ Publish system status ------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

#if CONFIG_MQTT_STATUS_LWT || CONFIG_MQTT_STATUS_ONLINE || CONFIG_MQTT_STATUS_ONLINE_SYSINFO

static char* _mqttTopicStatus = nullptr;

char* mqttTopicStatusCreate(const bool primary)
{
  if (_mqttTopicStatus) free(_mqttTopicStatus);
  _mqttTopicStatus = mqttGetTopicDevice1(primary, CONFIG_MQTT_STATUS_LOCAL, CONFIG_MQTT_STATUS_TOPIC);
  if (_mqttTopicStatus) {
    rlog_i(logTAG, "Generated topic for publishing system status: [ %s ]", _mqttTopicStatus);
  } else {
    rlog_i(logTAG, "Failed to denerate topic for publishing system status");
  };
  return _mqttTopicStatus;
}

char* mqttTopicStatusGet()
{
  if (!_mqttTopicStatus) {
    if (mqttStatesCheck(MQTTCLI_CONNECTED, false)) {
      mqttTopicStatusCreate(_mqttData.primary);
    };
  };
  return _mqttTopicStatus;
}

void mqttTopicStatusFree()
{
  if (_mqttTopicStatus) free(_mqttTopicStatus);
  _mqttTopicStatus = nullptr;
  rlog_d(logTAG, "Topic for publishing system status has been scrapped");
}

#endif // CONFIG_MQTT_STATUS_LWT || CONFIG_MQTT_STATUS_ONLINE || CONFIG_MQTT_STATUS_ONLINE_SYSINFO

// -----------------------------------------------------------------------------------------------------------------------
// -------------------------------------------------- Server selection ---------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

// Connect to server with new parameters
bool mqttServer1isLocal()
{
  return CONFIG_MQTT1_TYPE > 0;
}

bool mqttServer1Enabled()
{
  return mqttStatesCheck(MQTTCLI_SERVER1_AVAILABLED, false) && (mqttServer1isLocal() || mqttStatesCheck(MQTTCLI_INET_AVAILABLED, false));
}

#ifdef CONFIG_MQTT2_TYPE

bool mqttServer2isLocal()
{
  return CONFIG_MQTT2_TYPE > 0;
}

bool mqttServer2Enabled()
{
  return mqttStatesCheck(MQTTCLI_SERVER2_AVAILABLED, false) && (mqttServer2isLocal() || mqttStatesCheck(MQTTCLI_INET_AVAILABLED, false));
}

bool mqttServer1Activate()
{
  if (mqttStatesCheck(MQTTCLI_SERVER2_ACTIVE, false) || (_mqttClient == nullptr) || !mqttStatesCheck(MQTTCLI_STARTED, false)) {
    rlog_i(logTAG, "Primary MQTT broker selected");
    mqttBackToPrimaryTimerStop();
    mqttStatesClear(MQTTCLI_SERVER2_ACTIVE);
    if (_mqttClient) {
      if (mqttStatesCheck(MQTTCLI_STARTED, false)) {
        // The client is already running - can only be restarted through the event loop (from another task)
        return eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_SERVER_PRIMARY, nullptr, 0, portMAX_DELAY);
      } else {
        // The client is not running yet - you can just run it from this task
        return mqttClientRestart() == ESP_OK;
      };
    } else {
      // The client has not yet been created
      return mqttClientCreate() == ESP_OK;
    };
  };
  return true;
}

bool mqttServer2Activate()
{
  if (!mqttStatesCheck(MQTTCLI_SERVER2_ACTIVE, false) || (_mqttClient == nullptr) || !mqttStatesCheck(MQTTCLI_STARTED, false)) {
    rlog_i(logTAG, "Reserved MQTT broker selected");
    mqttBackToPrimaryTimerStart();
    mqttStatesSet(MQTTCLI_SERVER2_ACTIVE);
    if (_mqttClient) {
      if (mqttStatesCheck(MQTTCLI_STARTED, false)) {
        // The client is already running - can only be restarted through the event loop (from another task)
        return eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_SERVER_RESERVED, nullptr, 0, portMAX_DELAY);
      } else {
        // The client is not running yet - you can just run it from this task
        return mqttClientRestart() == ESP_OK;
      };
    } else {
      // The client has not yet been created
      return mqttClientCreate() == ESP_OK;
    };
  };
  return true;
}

// Setting network availability and starting the client, depending on which server is currently available
bool mqttServerSelectAuto()
{
  if (mqttServer1Enabled()) {
    return mqttServer1Activate();
  } else {
    if (mqttServer2Enabled()) {
      return mqttServer2Activate();
    } else {
      if (_mqttClient && mqttStatesCheck(MQTTCLI_STARTED, false)) {
        // Send event to suspend service
        return eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_SELF_STOP, nullptr, 0, portMAX_DELAY);
      };
    };
  };
  return false;
}

