kosszv/alcoholometer-esp32/clouds/reMqtt/src/reMqtt.cpp
// Server status change (by ping)
bool mqttServer2SetAvailable(bool newAvailable)
{
  if (mqttStatesCheck(MQTTCLI_SERVER2_AVAILABLED, false) != newAvailable) {
    mqttStatesSetBit(MQTTCLI_SERVER2_AVAILABLED, newAvailable);
    return mqttServerSelectAuto();
  };
  return false;
}

#else

bool mqttServerSelectAuto()
{
  if (mqttServer1Enabled()) {
    mqttStatesClear(MQTTCLI_SERVER2_ACTIVE);
    if (_mqttClient) {
      // The client is not running yet - you can just run it from this task
      return mqttClientRestart() == ESP_OK;
    } else {
      // The client has not yet been created
      return mqttClientCreate() == ESP_OK;
    };
  } else {
    // Send event to suspend service
    return eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_SELF_STOP, nullptr, 0, portMAX_DELAY);
  };
}

#endif // CONFIG_MQTT2_TYPE

// Server status change (by ping)
bool mqttServer1SetAvailable(bool newAvailable)
{
  if (mqttStatesCheck(MQTTCLI_SERVER1_AVAILABLED, false) != newAvailable) {
    mqttStatesSetBit(MQTTCLI_SERVER1_AVAILABLED, newAvailable);
    return mqttServerSelectAuto();
  };
  return false;
}

// Server status change (by internet)
bool mqttServerSetInetAvailable(bool internetAvailable)
{
  mqttStatesSetBit(MQTTCLI_INET_AVAILABLED, internetAvailable);
  return mqttServerSelectAuto();
}

// -----------------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------- Subscribe -------------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

bool mqttSubscribe(const char *topic, int qos)
{
  if (mqttStatesCheck(MQTTCLI_CONNECTED, false) && (topic != nullptr)) {
    if (esp_mqtt_client_subscribe(_mqttClient, topic, qos) == -1) {
      rlog_e(logTAG, "Failed to subscribe to topic \"%s\"", topic);
      mqttErrorEventSend("Failed to subscribe to topic \"%s\"", topic);
      return false;
    };
    rlog_i(logTAG, "Subscribed to: \"%s\"", topic);
    return true;
  };
  return false;
}

bool mqttUnsubscribe(const char *topic)
{
  if (mqttStatesCheck(MQTTCLI_CONNECTED, false) && (topic != nullptr)) {
    if (esp_mqtt_client_unsubscribe(_mqttClient, topic) == -1) {
      rlog_e(logTAG, "Failed to unsubscribe from topic \"%s\"", topic);
      mqttErrorEventSend("Failed to unsubscribe from topic \"%s\"", topic);
      return false;
    };
    rlog_i(logTAG, "Unsubscribed from: \"%s\"", topic);
    return true;
  };
  return false;
}

// -----------------------------------------------------------------------------------------------------------------------
// ------------------------------------------------------ Publish --------------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

esp_err_t mqttPublish(char *topic, char *payload, int qos, bool retained, bool free_topic, bool free_payload)
{
  esp_err_t err = ESP_ERR_INVALID_ARG;

  if (topic != nullptr) {
    size_t payload_len;
    if (payload == nullptr) {
      payload_len = 0;
    } else {
      payload_len = strlen(payload);
    };

    #if defined(CONFIG_MQTT_MAX_OUTBOX_SIZE) && (CONFIG_MQTT_MAX_OUTBOX_SIZE > 0)
      bool _enqueueOutbox = esp_mqtt_client_get_outbox_size(_mqttClient) < CONFIG_MQTT_MAX_OUTBOX_SIZE;
    #else
      bool _enqueueOutbox = true;
    #endif // CONFIG_MQTT_MAX_OUTBOX_SIZE

    #if defined(CONFIG_MQTT_MAX_OUTBOX_MESSAGE_SIZE) && (CONFIG_MQTT_MAX_OUTBOX_MESSAGE_SIZE > 0)
      bool _enqueueMessage = payload_len < CONFIG_MQTT_MAX_OUTBOX_MESSAGE_SIZE;
    #else
      bool _enqueueMessage = true;
    #endif // CONFIG_MQTT_MAX_OUTBOX_MESSAGE_SIZE

    if (mqttStatesCheck(MQTTCLI_CONNECTED, false)) {
      if (_enqueueOutbox && _enqueueMessage) {
        esp_mqtt_client_enqueue(_mqttClient, topic, payload, payload_len, qos, retained, true) > -1 ? err = ESP_OK : err = ESP_FAIL;
      } else {
        esp_mqtt_client_publish(_mqttClient, topic, payload, payload_len, qos, retained) > -1 ? err = ESP_OK : err = ESP_FAIL;
      };
    } else {
      if (_enqueueOutbox && _enqueueMessage) {
        esp_mqtt_client_enqueue(_mqttClient, topic, payload, payload_len, qos, retained, true) > -1 ? err = ESP_OK : err = ESP_FAIL;
      } else {
        err = ESP_ERR_INVALID_STATE;
      };
    };

    if (err == ESP_OK) {
      if (payload == nullptr) {
        rlog_i(logTAG, "Publish to topic \"%s\": NULL [ 0 bytes ]", topic);
      } else if (strlen(payload) > MQTT_LOG_PAYLOAD_LIMIT) {
        rlog_i(logTAG, "Publish to topic \"%s\": [ %d bytes ]", topic, strlen(payload));
      } else {
        rlog_i(logTAG, "Publish to topic \"%s\": %s", topic, payload);
      };
    } else {
      rlog_e(logTAG, "Failed to publish to topic \"%s\": %d, %s", topic, err, esp_err_to_name(err));
      mqttErrorEventSendCode("Failed to publish to topic \"%s\": %d, %s", topic, err);
    };
  };

  if (free_topic && (topic != nullptr)) free(topic);
  if (free_payload && (payload != nullptr)) free(payload);
  return err;
}

// -----------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------- Event callback ---------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

static void mqttEventHandler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
  // esp_mqtt_client_handle_t client = data->client;
  esp_mqtt_event_handle_t data = (esp_mqtt_event_handle_t)event_data;
  static char* str_value = nullptr;
  static re_mqtt_incoming_data_t in_buffer;
  memset(&in_buffer, 0, sizeof(re_mqtt_incoming_data_t));

  switch (data->event_id) {
    case MQTT_EVENT_BEFORE_CONNECT:
      _mqttConnAttempt++;
      mqttStatesClear(MQTTCLI_CONNECTED);
      if (_mqttConnAttempt > 1) {
        rlog_w(logTAG, "Attempt # %d to connect to MQTT broker [ %s : %d ]...", _mqttConnAttempt, _mqttData.host, _mqttData.port);
      } else {
        rlog_i(logTAG, "Attempt # %d to connect to MQTT broker [ %s : %d ]...", _mqttConnAttempt, _mqttData.host, _mqttData.port);
      };
      #if CONFIG_SYSLED_MQTT_ACTIVITY
        ledSysActivity();
      #endif // CONFIG_SYSLED_MQTT_ACTIVITY
    break;

    case MQTT_EVENT_CONNECTED:
      _mqttConnAttempt = 0;
      mqttStatesSet(MQTTCLI_CONNECTED);
      rlog_i(logTAG, "Connection to MQTT broker [ %s : %d ] established", _mqttData.host, _mqttData.port);
      // Repost event to main event loop
      eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_CONNECTED, &_mqttData, sizeof(_mqttData), portMAX_DELAY);
      mqttErrorEventClear();
      // Publish ONLINE static status
      #if CONFIG_MQTT_STATUS_ONLINE || CONFIG_MQTT_STATUS_ONLINE_SYSINFO
        mqttPublish(mqttTopicStatusGet(), (char*)CONFIG_MQTT_STATUS_ONLINE_PAYLOAD, 
          CONFIG_MQTT_STATUS_QOS, CONFIG_MQTT_STATUS_RETAINED, false, false);
      #endif // CONFIG_MQTT_STATUS_ONLINE || CONFIG_MQTT_STATUS_ONLINE_SYSINFO
      break;

