kosszv/alcoholometer-esp32/clouds/reMqtt/src/reMqtt.cpp
    case MQTT_EVENT_DISCONNECTED:
      mqttErrorEventSend(nullptr, nullptr);
      if (mqttStatesCheck(MQTTCLI_CONNECTED, false)) {
        // The connection has already been established before, the connection is lost
        mqttStatesClear(MQTTCLI_CONNECTED);
        rlog_w(logTAG, "Lost connection to MQTT broker [ %s : %d ]", _mqttData.host, _mqttData.port);
        // Repost event to main event loop
        eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_CONN_LOST, &_mqttData, sizeof(_mqttData), portMAX_DELAY);
      } else {
        // Failed to establish connection
        if (_mqttConnAttempt == CONFIG_MQTT_CONNECT_ATTEMPTS) {
          // Repost event to main event loop
          eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_CONN_FAILED, &_mqttData, sizeof(_mqttData), portMAX_DELAY);
          _mqttConnAttempt = 0;
          #ifdef CONFIG_MQTT2_TYPE
            // Switching to the another server - disable current server
            if (mqttStatesCheck(MQTTCLI_SERVER2_ACTIVE, false)) {
              mqttServer2SetAvailable(false);
            } else {
              mqttServer1SetAvailable(false);
            };
          #endif // CONFIG_MQTT2_TYPE
        };
      };
      break;

    case MQTT_EVENT_SUBSCRIBED:
    case MQTT_EVENT_UNSUBSCRIBED:
    case MQTT_EVENT_PUBLISHED:
      mqttErrorEventClear();
      #if CONFIG_SYSLED_MQTT_ACTIVITY
        ledSysActivity();
      #endif // CONFIG_SYSLED_MQTT_ACTIVITY
      break;
    
    case MQTT_EVENT_DATA:
      if (event_data) {
        if (data->current_data_offset == 0) {
          if (in_buffer.topic) free(in_buffer.topic);
          in_buffer.topic = nullptr;
          if (in_buffer.data) free(in_buffer.data);
          in_buffer.data = (char*)esp_calloc(1, data->total_data_len+1);
        };
        if (in_buffer.data) {
          memcpy(in_buffer.data+data->current_data_offset, data->data, data->data_len);
          if (data->current_data_offset + data->data_len == data->total_data_len) {
            in_buffer.topic = malloc_stringl(data->topic, data->topic_len);
            if (in_buffer.topic) {
              in_buffer.topic_len = data->topic_len;
              in_buffer.data_len = data->total_data_len;
              rlog_d(logTAG, "Incoming message \"%.*s\": [%s]", data->topic_len, data->topic, in_buffer.data);
              // Repost string to main event loop
              eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_INCOMING_DATA, &in_buffer, sizeof(in_buffer), portMAX_DELAY);
              #if CONFIG_SYSLED_MQTT_ACTIVITY
                ledSysActivity();
              #endif // CONFIG_SYSLED_MQTT_ACTIVITY
            };
          };
        };
      };
      break;
    
    case MQTT_EVENT_ERROR:
      if (event_data) {
        rlog_e(logTAG, "MQTT client error!");
        // Generate error message
        if (data->error_handle->error_type == MQTT_ERROR_TYPE_TCP_TRANSPORT) {
          str_value = malloc_stringf("Transport error: %d\n  - %s\nESP_TLS error:   0x%X\nTLS stack error: 0x%X", 
            data->error_handle->esp_transport_sock_errno, strerror(data->error_handle->esp_transport_sock_errno),
            data->error_handle->esp_tls_last_esp_err, data->error_handle->esp_tls_stack_err);
        } else if (data->error_handle->error_type == MQTT_ERROR_TYPE_CONNECTION_REFUSED) {
          str_value = malloc_stringf("Connection refused, error: 0x%x", 
            data->error_handle->connect_return_code);
        } else {
          str_value = malloc_stringf("Unknown error type: 0x%x", 
            data->error_handle->error_type);
        };
        // Repost event to main event loop
        mqttErrorEventSend(str_value, nullptr);
      };
      #if CONFIG_SYSLED_MQTT_ACTIVITY
        ledSysActivity();
      #endif // CONFIG_SYSLED_MQTT_ACTIVITY
      break;

    default:
      rlog_w(logTAG, "Other event id: %d", data->event_id); 
      break;
  };
  // Free resources
  if (str_value) {
    free(str_value);
    str_value = nullptr;
  };
}

// -----------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------- Configuration -----------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

void mqttSetConfigPrimary(esp_mqtt_client_config_t * mqttCfg)
{
  // Host
  _mqttData.primary = true;
  #if CONFIG_MQTT1_TYPE == 0
    _mqttData.local = false;
  #else
    _mqttData.local = true;
  #endif // CONFIG_MQTT1_TYPE == 0

  memset(_mqttData.host, 0, sizeof(_mqttData.host));
  #if CONFIG_MQTT1_TYPE == 2
    char *_host = wifiGetGatewayIP();
    if (_host) {
      strcpy(_mqttData.host, _host);
      free(_host);
    };
  #else
    strcpy(_mqttData.host, CONFIG_MQTT1_HOST);
  #endif // CONFIG_MQTT1_TYPE == 2

  #if ESP_IDF_VERSION_MAJOR < 5
    // Hostname
    mqttCfg->host = _mqttData.host;

    // Port and transport
    #if CONFIG_MQTT1_TLS_ENABLED
      _mqttData.port = CONFIG_MQTT1_PORT_TLS;
      mqttCfg->port = CONFIG_MQTT1_PORT_TLS;
      mqttCfg->skip_cert_common_name_check = false;
      mqttCfg->transport = MQTT_TRANSPORT_OVER_SSL;
      #if CONFIG_MQTT1_TLS_STORAGE == TLS_CERT_BUFFER
        mqttCfg->cert_pem = (const char *)mqtt1_broker_pem_start;
        mqttCfg->cert_len = mqtt1_broker_pem_end - mqtt1_broker_pem_start;
        mqttCfg->use_global_ca_store = false;
      #elif CONFIG_MQTT1_TLS_STORAGE == TLS_CERT_GLOBAL
        mqttCfg->use_global_ca_store = true;
      #elif CONFIG_MQTT1_TLS_STORAGE == TLS_CERT_BUNDLE
        mqttCfg->crt_bundle_attach = esp_crt_bundle_attach;
        mqttCfg->use_global_ca_store = false;
      #endif // CONFIG_MQTT2_TLS_STORAGE
    #else
      _mqttData.port = CONFIG_MQTT1_PORT_TCP;
      mqttCfg->transport = MQTT_TRANSPORT_OVER_TCP;
      mqttCfg->port = CONFIG_MQTT1_PORT_TCP;
    #endif // CONFIG_MQTT1_TLS_ENABLED

