kosszv/alcoholometer-esp32/clouds/reMqtt/src/reMqtt.cpp
    // Credentials
    #ifdef CONFIG_MQTT2_USERNAME
      mqttCfg->username = CONFIG_MQTT2_USERNAME;
      #ifdef CONFIG_MQTT2_PASSWORD
        mqttCfg->password = CONFIG_MQTT2_PASSWORD;
      #endif // CONFIG_MQTT2_PASSWORD
    #endif // CONFIG_MQTT2_USERNAME

    // ClientId, if needed. Otherwise ClientId will be generated automatically
    #ifdef CONFIG_MQTT2_CLIENTID
      mqttCfg->client_id = CONFIG_MQTT2_CLIENTID;
    #endif // CONFIG_MQTT_CLIENTID

    // Network parameters
    mqttCfg->network_timeout_ms = CONFIG_MQTT2_TIMEOUT;
    mqttCfg->reconnect_timeout_ms = CONFIG_MQTT2_RECONNECT;
    mqttCfg->disable_auto_reconnect = !CONFIG_MQTT2_AUTO_RECONNECT;

    // Session parameters
    mqttCfg->disable_clean_session = !CONFIG_MQTT2_CLEAN_SESSION;
    mqttCfg->keepalive = CONFIG_MQTT2_KEEP_ALIVE;
    mqttCfg->disable_keepalive = false;

    // LWT
    #if CONFIG_MQTT_STATUS_LWT
      mqttCfg->lwt_topic = mqttTopicStatusCreate(true);
      mqttCfg->lwt_msg = CONFIG_MQTT_STATUS_LWT_PAYLOAD;
      mqttCfg->lwt_msg_len = strlen(CONFIG_MQTT_STATUS_LWT_PAYLOAD);
      mqttCfg->lwt_qos = CONFIG_MQTT_STATUS_QOS;
      mqttCfg->lwt_retain = CONFIG_MQTT_STATUS_RETAINED;
    #endif // CONFIG_MQTT_STATUS_LWT

    // Task & buffers
    mqttCfg->buffer_size = CONFIG_MQTT_READ_BUFFER_SIZE;
    mqttCfg->out_buffer_size = CONFIG_MQTT_WRITE_BUFFER_SIZE;
    mqttCfg->task_prio = CONFIG_TASK_PRIORITY_MQTT_CLIENT;
    mqttCfg->task_stack = CONFIG_MQTT_CLIENT_STACK_SIZE;
  #else
    // Hostname
    mqttCfg->broker.address.hostname = _mqttData.host;

    // Port and transport
    #if CONFIG_MQTT2_TLS_ENABLED
      _mqttData.port = CONFIG_MQTT2_PORT_TLS;
      mqttCfg->broker.address.port = CONFIG_MQTT2_PORT_TLS;
      mqttCfg->broker.address.transport = MQTT_TRANSPORT_OVER_SSL;
      mqttCfg->broker.verification.skip_cert_common_name_check = false;
      #if CONFIG_MQTT2_TLS_STORAGE == TLS_CERT_BUFFER
        mqttCfg->broker.verification.certificate = (const char *)mqtt2_broker_pem_start;
        mqttCfg->broker.verification.certificate_len = mqtt2_broker_pem_end - mqtt2_broker_pem_start;
        mqttCfg->broker.verification.use_global_ca_store = false;
      #elif CONFIG_MQTT2_TLS_STORAGE == TLS_CERT_GLOBAL
        mqttCfg->broker.verification.use_global_ca_store = true;
      #elif CONFIG_MQTT2_TLS_STORAGE == TLS_CERT_BUNDLE
        mqttCfg->broker.verification.crt_bundle_attach = esp_crt_bundle_attach;
        mqttCfg->broker.verification.use_global_ca_store = false;
      #endif // CONFIG_MQTT2_TLS_STORAGE
    #else
      _mqttData.port = CONFIG_MQTT2_PORT_TCP;
      mqttCfg->broker.address.transport = MQTT_TRANSPORT_OVER_TCP;
      mqttCfg->broker.address.port = CONFIG_MQTT2_PORT_TCP;
    #endif // CONFIG_MQTT2_TLS_ENABLED

    // Credentials
    #ifdef CONFIG_MQTT2_USERNAME
      mqttCfg->credentials.username = CONFIG_MQTT2_USERNAME;
      #ifdef CONFIG_MQTT2_PASSWORD
        mqttCfg->credentials.authentication.password = CONFIG_MQTT2_PASSWORD;
      #endif // CONFIG_MQTT2_PASSWORD
    #endif // CONFIG_MQTT2_USERNAME

    // ClientId, if needed. Otherwise ClientId will be generated automatically
    #ifdef CONFIG_MQTT2_CLIENTID
      mqttCfg->credentials.client_id = CONFIG_MQTT2_CLIENTID;
    #endif // CONFIG_MQTT_CLIENTID

    // Network parameters
    mqttCfg->network.timeout_ms = CONFIG_MQTT2_TIMEOUT;
    mqttCfg->network.reconnect_timeout_ms = CONFIG_MQTT2_RECONNECT;
    mqttCfg->network.disable_auto_reconnect = !CONFIG_MQTT2_AUTO_RECONNECT;

    // Session parameters
    mqttCfg->session.disable_clean_session = !CONFIG_MQTT2_CLEAN_SESSION;
    mqttCfg->session.keepalive = CONFIG_MQTT2_KEEP_ALIVE;
    mqttCfg->session.disable_keepalive = false;

    // LWT
    #if CONFIG_MQTT_STATUS_LWT
      mqttCfg->session.last_will.topic = mqttTopicStatusCreate(false);
      mqttCfg->session.last_will.msg = CONFIG_MQTT_STATUS_LWT_PAYLOAD;
      mqttCfg->session.last_will.msg_len = strlen(CONFIG_MQTT_STATUS_LWT_PAYLOAD);
      mqttCfg->session.last_will.qos = CONFIG_MQTT_STATUS_QOS;
      mqttCfg->session.last_will.retain = CONFIG_MQTT_STATUS_RETAINED;
    #endif // CONFIG_MQTT_STATUS_LWT

    // Task & buffers
    mqttCfg->task.priority = CONFIG_TASK_PRIORITY_MQTT_CLIENT;
    mqttCfg->task.stack_size = CONFIG_MQTT_CLIENT_STACK_SIZE;
    mqttCfg->buffer.size = CONFIG_MQTT_READ_BUFFER_SIZE;
    mqttCfg->buffer.out_size = CONFIG_MQTT_WRITE_BUFFER_SIZE;
  #endif // #if ESP_IDF_VERSION_MAJOR
}

#endif // CONFIG_MQTT2_TYPE

esp_err_t mqttInitConfig(esp_mqtt_client_config_t * mqttCfg)
{
  RE_MEM_CHECK_EVENT(mqttCfg, return ESP_ERR_INVALID_ARG);

  _mqttConnAttempt = 0;
  memset(&_mqttData, 0, sizeof(_mqttData));
  memset(mqttCfg, 0, sizeof(esp_mqtt_client_config_t));
  mqttStatesClear(MQTTCLI_STARTED | MQTTCLI_CONNECTED);

  #ifdef CONFIG_MQTT2_TYPE
    mqttStatesCheck(MQTTCLI_SERVER2_ACTIVE, false) ? mqttSetConfigReserved(mqttCfg) : mqttSetConfigPrimary(mqttCfg);
  #else
    mqttSetConfigPrimary(mqttCfg);
  #endif // CONFIG_MQTT2_TYPE

  #if ESP_IDF_VERSION_MAJOR < 5
    RE_MEM_CHECK_EVENT(mqttCfg->host, return ESP_ERR_INVALID_ARG);
    #if CONFIG_MQTT_STATUS_LWT
      RE_MEM_CHECK_EVENT(mqttCfg->lwt_topic, return ESP_ERR_INVALID_ARG);
    #endif // CONFIG_MQTT_STATUS_LWT
  #else
    RE_MEM_CHECK_EVENT(mqttCfg->broker.address.hostname, return ESP_ERR_INVALID_ARG);
    #if CONFIG_MQTT_STATUS_LWT
      RE_MEM_CHECK_EVENT(mqttCfg->session.last_will.topic, return ESP_ERR_INVALID_ARG);
    #endif // CONFIG_MQTT_STATUS_LWT
  #endif // ESP_IDF_VERSION_MAJOR

  return ESP_OK;
}

// -----------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------- Client routines ---------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

