kosszv/alcoholometer-esp32/clouds/reMqtt/src/reMqtt.cpp
esp_err_t mqttClientCreate() 
{
  if (_mqttClient == nullptr) {
    rlog_i(logTAG, "Create MQTT client...");

    // Set configuration
    esp_mqtt_client_config_t _mqttCfg;
    esp_err_t err = mqttInitConfig(&_mqttCfg);
    if (err != ESP_OK) return err;

    // Init client
    _mqttClient = esp_mqtt_client_init(&_mqttCfg);
    if (_mqttClient == nullptr) {
      rlog_e(logTAG, "Failed to create task [ MQTT_CLIENT ]: out of memory");
      mqttErrorEventSendCode("Failed to create task [ MQTT_CLIENT ]: %d %s", nullptr, ESP_ERR_NO_MEM);
      return ESP_ERR_NO_MEM;
    };
    
    err = esp_mqtt_client_register_event(_mqttClient, MQTT_EVENT_ANY, mqttEventHandler, _mqttClient);
    if (err != ESP_OK) {
      mqttErrorEventSendCode("Failed to create task (re) [ MQTT_CLIENT ]: %d %s", nullptr, err);
      rlog_e(logTAG, "Failed to create task (re) [ MQTT_CLIENT ]: %d %s", err, esp_err_to_name(err));
    };

    // Start client
    err = esp_mqtt_client_start(_mqttClient);
    if (err == ESP_OK) {
      mqttStatesSet(MQTTCLI_STARTED);
      rlog_i(logTAG, "Task [ MQTT_CLIENT ] was started");
    } else {
      mqttErrorEventSendCode("Failed to start task [ MQTT_CLIENT ]: %d %s", nullptr, err);
      rlog_e(logTAG, "Failed to start task [ MQTT_CLIENT ]: %d %s", err, esp_err_to_name(err));
    };

    return err;
  } else {
    return mqttClientRestart();
  };
}

esp_err_t mqttClientRestart()
{
  rlog_w(logTAG, "Restart MQTT client...");

  // Close the current connection if it exists
  esp_err_t err = mqttClientStop();
  if (err != ESP_OK) return err;

  // Set new configuration
  esp_mqtt_client_config_t _mqttCfg;
  err = mqttInitConfig(&_mqttCfg);
  if (err != ESP_OK) return err;

  err = esp_mqtt_set_config(_mqttClient, &_mqttCfg);
  if (err != ESP_OK) {
    mqttErrorEventSendCode("Failed to configure MQTT client [ MQTT_CLIENT ]: %d %s", nullptr, err);
    rlog_e(logTAG, "Failed to configure MQTT client [ MQTT_CLIENT ]: %d %s", err, esp_err_to_name(err));
    return err;
  };
    
  // Start client
  err = esp_mqtt_client_start(_mqttClient);
  if (err == ESP_OK) {
    mqttStatesSet(MQTTCLI_STARTED);
    rlog_i(logTAG, "Task [ MQTT_CLIENT ] was started");
  } else {
    mqttErrorEventSendCode("Failed to start task [ MQTT_CLIENT ]: %d %s", nullptr, err);
    rlog_e(logTAG, "Failed to start task [ MQTT_CLIENT ]: %d %s", err, esp_err_to_name(err));
  };
  return err;
}

esp_err_t mqttClientStop()
{
  if (_mqttClient) {
    if (mqttStatesCheck(MQTTCLI_STARTED, false)) {
      rlog_w(logTAG, "Stop MQTT client...");
      esp_err_t err = esp_mqtt_client_stop(_mqttClient);
      if (err == ESP_OK) {
        if (mqttStatesCheck(MQTTCLI_CONNECTED, false)) {
          eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_CONN_LOST, &_mqttData, sizeof(_mqttData), portMAX_DELAY);
        };
        rlog_i(logTAG, "Task [ MQTT_CLIENT ] was stopped");
        // Reset variables
        _mqttConnAttempt = 0;
        mqttStatesClear(MQTTCLI_STARTED | MQTTCLI_CONNECTED);
        #if CONFIG_MQTT_STATUS_LWT || CONFIG_MQTT_STATUS_ONLINE
          mqttTopicStatusFree();
        #endif // CONFIG_MQTT_STATUS_LWT
      } else {
        mqttErrorEventSendCode("Failed to stop task [ MQTT_CLIENT ]: %d %s", nullptr, err);
        rlog_e(logTAG, "Failed to stop task [ MQTT_CLIENT ]: %d %s", err, esp_err_to_name(err));
      };
      return err;
    };
    return ESP_OK;
  };
  return ESP_FAIL;
}

esp_err_t mqttClientDestroy()
{
  if (_mqttClient) {
    rlog_w(logTAG, "Destroy MQTT client...");
    // Disсonnect from server and stop task
    mqttClientStop();
    // Destoy client
    esp_err_t err = esp_mqtt_client_destroy(_mqttClient);
    if (err == ESP_OK) {
      // Reset variables
      _mqttClient = nullptr;
      rlog_i(logTAG, "Task [ MQTT_CLIENT ] was deleted");
    } else {
      rlog_e(logTAG, "Failed to destroy task [ MQTT_CLIENT ]: %d %s", err, esp_err_to_name(err));
    };
  };
  return ESP_OK;
}

// -----------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------- Task routines ----------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

bool mqttTaskInit()
{
  return mqttStatesInit() && mqttBackToPrimaryTimerInit();
}

bool mqttTaskStart(bool createSuspended)
{
  if (createSuspended) {
    return mqttTaskInit() && mqttEventHandlerRegister();
  } else {
    return mqttTaskInit() && mqttEventHandlerRegister() && mqttServerSelectAuto();
  };
}

bool mqttTaskRestart()
{
  return eventLoopPost(RE_MQTT_EVENTS, RE_MQTT_COLD_RESTART, nullptr, 0, portMAX_DELAY);
}

bool mqttTaskFree()
{
  if (mqttClientDestroy()) {
    mqttEventHandlerUnregister();
    mqttBackToPrimaryTimerFree();
    mqttStatesFree();
    return true;
  };
  return false;
}

// -----------------------------------------------------------------------------------------------------------------------
// -------------------------------------------------- WiFi event handler -------------------------------------------------
// -----------------------------------------------------------------------------------------------------------------------

static void mqttWiFiEventHandler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data)
{
  // STA connected, Internet access not checked
  if (event_id == RE_WIFI_STA_GOT_IP) {
    // rlog_v(logTAG, "Event received: RE_WIFI_STA_GOT_IP");
    mqttServerSetInetAvailable(false);
  }
  // STA connected and Internet access is available
  else if (event_id == RE_WIFI_STA_PING_OK) {
    // rlog_v(logTAG, "Event received: RE_WIFI_STA_PING_OK");
    mqttServerSetInetAvailable(true);
  }
  // Internet access lost
  else if (event_id == RE_WIFI_STA_PING_FAILED) {
    // rlog_v(logTAG, "Event received: RE_WIFI_STA_PING_FAILED");
    mqttServerSetInetAvailable(false);
  }
  // STA disconnected
  else if ((event_id == RE_WIFI_STA_DISCONNECTED) || (event_id == RE_WIFI_STA_STOPPED)) {
    // rlog_v(logTAG, "Event received: RE_WIFI_STA_DISCONNECTED");
    if (mqttStatesCheck(MQTTCLI_STARTED, false)) {
      mqttClientStop();
    };
  };
}

