kosszv/alcoholometer-esp32/clouds/reMqtt/src/reMqtt.cpp
static void mqttSelfEventHandler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data)
{
  if (event_id == RE_MQTT_SELF_STOP) {
    mqttClientStop();
  } else if ((event_id == RE_MQTT_SERVER_PRIMARY) || (event_id == RE_MQTT_SERVER_RESERVED)) {
    uint8_t cntTry = 0;
    while (cntTry < 60) {
      cntTry++;
      if (mqttClientStop() == ESP_OK) break;
      vTaskDelay(pdMS_TO_TICKS(1000));
    };
    mqttClientRestart();
  } else if (event_id == RE_MQTT_COLD_RESTART) {
    uint8_t cntTry = 0;
    while (cntTry < 60) {
      cntTry++;
      if (mqttClientDestroy() == ESP_OK) break;
      vTaskDelay(pdMS_TO_TICKS(1000));
    };
    mqttClientCreate();
  };
}

#if defined(CONFIG_MQTT1_PING_CHECK) && CONFIG_MQTT1_PING_CHECK
static void mqttPing1EventHandler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data)
{
  // rlog_d("tgEVT", "Recieved PING event: %s %d", event_base, event_id);
  ping_inet_data_t* data = (ping_inet_data_t*)event_data;

  // Broker 1 is available
  if (event_id == RE_PING_MQTT1_AVAILABLE) {
    rlog_v(logTAG, "Event received: RE_PING_MQTT1_AVAILABLE");
    mqttServer1SetAvailable(true);
  }
  // Broker 1 is unavailable
  else if (event_id == RE_PING_MQTT1_UNAVAILABLE) {
    rlog_v(logTAG, "Event received: RE_PING_MQTT1_UNAVAILABLE");
    mqttServer1SetAvailable(false);
  }
}
#endif // CONFIG_MQTT1_PING_CHECK

#if defined(CONFIG_MQTT2_TYPE) && defined(CONFIG_MQTT2_PING_CHECK) && CONFIG_MQTT2_PING_CHECK
static void mqttPing2EventHandler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data)
{
  // rlog_d("tgEVT", "Recieved PING event: %s %d", event_base, event_id);
  ping_inet_data_t* data = (ping_inet_data_t*)event_data;

  // Broker 2 is available
  if (event_id == RE_PING_MQTT2_AVAILABLE) {
    rlog_v(logTAG, "Event received: RE_PING_MQTT2_AVAILABLE");
    mqttServer2SetAvailable(true);
  }
  // Broker 2 is unavailable
  else if (event_id == RE_PING_MQTT2_UNAVAILABLE) {
    rlog_v(logTAG, "Event received: RE_PING_MQTT2_UNAVAILABLE");
    mqttServer2SetAvailable(false);
  }
}
#endif // CONFIG_MQTT1_PING_CHECK

bool mqttEventHandlerRegister()
{
  rlog_d(logTAG, "Register MQTT event handlers...");
  return eventHandlerRegister(RE_WIFI_EVENTS, ESP_EVENT_ANY_ID, &mqttWiFiEventHandler, nullptr) 
      #if defined(CONFIG_MQTT1_PING_CHECK) && CONFIG_MQTT1_PING_CHECK
      && eventHandlerRegister(RE_PING_EVENTS, RE_PING_MQTT1_AVAILABLE, &mqttPing1EventHandler, nullptr)
      && eventHandlerRegister(RE_PING_EVENTS, RE_PING_MQTT1_UNAVAILABLE, &mqttPing1EventHandler, nullptr)
      #endif // CONFIG_MQTT1_PING_CHECK
      #if defined(CONFIG_MQTT2_TYPE) && defined(CONFIG_MQTT2_PING_CHECK) && CONFIG_MQTT2_PING_CHECK
      && eventHandlerRegister(RE_PING_EVENTS, RE_PING_MQTT2_AVAILABLE, &mqttPing2EventHandler, nullptr)
      && eventHandlerRegister(RE_PING_EVENTS, RE_PING_MQTT2_UNAVAILABLE, &mqttPing2EventHandler, nullptr)
      #endif // CONFIG_MQTT2_PING_CHECK
      && eventHandlerRegister(RE_MQTT_EVENTS, RE_MQTT_COLD_RESTART, &mqttSelfEventHandler, nullptr)
      && eventHandlerRegister(RE_MQTT_EVENTS, RE_MQTT_SELF_STOP, &mqttSelfEventHandler, nullptr)
      && eventHandlerRegister(RE_MQTT_EVENTS, RE_MQTT_SERVER_PRIMARY, &mqttSelfEventHandler, nullptr)
      && eventHandlerRegister(RE_MQTT_EVENTS, RE_MQTT_SERVER_RESERVED, &mqttSelfEventHandler, nullptr);
}

void mqttEventHandlerUnregister()
{
  rlog_d(logTAG, "Unregister MQTT event handlers...");
  eventHandlerUnregister(RE_WIFI_EVENTS, ESP_EVENT_ANY_ID, &mqttWiFiEventHandler);
  #if defined(CONFIG_MQTT1_PING_CHECK) && CONFIG_MQTT1_PING_CHECK
    eventHandlerUnregister(RE_PING_EVENTS, RE_PING_MQTT1_AVAILABLE, &mqttPing1EventHandler);
    eventHandlerUnregister(RE_PING_EVENTS, RE_PING_MQTT1_UNAVAILABLE, &mqttPing1EventHandler);
  #endif // CONFIG_MQTT1_PING_CHECK
  #if defined(CONFIG_MQTT2_TYPE) && defined(CONFIG_MQTT2_PING_CHECK) && CONFIG_MQTT2_PING_CHECK
    eventHandlerUnregister(RE_PING_EVENTS, RE_PING_MQTT2_AVAILABLE, &mqttPing2EventHandler);
    eventHandlerUnregister(RE_PING_EVENTS, RE_PING_MQTT2_UNAVAILABLE, &mqttPing2EventHandler);
  #endif // CONFIG_MQTT2_PING_CHECK
  eventHandlerUnregister(RE_MQTT_EVENTS, RE_MQTT_COLD_RESTART, &mqttSelfEventHandler);
  eventHandlerUnregister(RE_MQTT_EVENTS, RE_MQTT_SELF_STOP, &mqttSelfEventHandler);
  eventHandlerUnregister(RE_MQTT_EVENTS, RE_MQTT_SERVER_PRIMARY, &mqttSelfEventHandler);
  eventHandlerUnregister(RE_MQTT_EVENTS, RE_MQTT_SERVER_RESERVED, &mqttSelfEventHandler);
}
